Repository: aztemi/wc-solana-pay
Catalog: languages/solana-pay-for-woocommerce-*.po
Languages: de_de, tr_tr

source: Settings
de_de: Einstellungen
tr_tr: Ayarlar

source: Accept payments in SOL, USDC, USDT and more with Solana Pay.
de_de: Nehmen Sie mit Solana Pay Zahlungen in SOL, USDC, USDT und mehr entgegen.
tr_tr: Solana Pay ile SOL, USDC, USDT ve diğer kripto paraları ödemeleri kabul edin.

source: Test Mode enabled. Devnet in use
de_de: Testmodus aktiviert. Devnet im Einsatz
tr_tr: Test Modu etkinleştirildi. Devnet kullanımda

source: Solana Pay setup is not complete. Please set Merchant Wallet Address
de_de: Die Einrichtung von Solana Pay ist nicht vollständig. Bitte Händler-Wallet-Adresse einstellen
tr_tr: Solana Pay kurulumu tamamlanmadı. Lütfen Satıcı Cüzdan Adresini ayarlayın

source: Solana Pay setup is not complete. Please set Mainnet-Beta RPC Endpoint
de_de: Die Einrichtung von Solana Pay ist nicht vollständig. Bitte Mainnet-Beta RPC Endpunkt einstellen
tr_tr: Solana Pay kurulumu tamamlanmadı. Lütfen Mainnet-Beta RPC Uç Noktasını ayarlayın

source: Solana Pay setup is not complete. Please enable at least 1 Solana Token.
de_de: Die Einrichtung von Solana Pay ist nicht vollständig. Bitte aktivieren Sie mindestens 1 Solana Token.
tr_tr: Solana Pay kurulumu tamamlanmadı. Lütfen en az 1 Solana jetonu (token) etkinleştirin.

source: Invalid Solana Wallet Address
de_de: Ungültige Solana-Wallet-Adresse
tr_tr: Geçersiz Solana Cüzdan Adresi

source: Invalid Mainnet-Beta RPC Endpoint
de_de: Ungültiger Mainnet-Beta RPC-Endpunkt
tr_tr: Geçersiz Mainnet-Beta RPC Uç Noktası

source: Update currently not available. Please check your connection and reload.
de_de: Update derzeit nicht verfügbar. Bitte überprüfen Sie Ihre Verbindung und laden Sie neu.
tr_tr: Güncelleme şu anda kullanılamıyor. Lütfen bağlantınızı kontrol edin ve yeniden yükleyin.

source: Thank you for your order
de_de: Vielen Dank für Ihre Bestellung
tr_tr: Bizi tercih ettiğiniz için teşekkür ederiz

source: RPC remote call failed with code %d
de_de: RPC-Fernaufruf mit Code %d fehlgeschlagen
tr_tr: RPC uzak araması, %d koduyla başarısız oldu

source: Connection to RPC failed
de_de: Die Verbindung zum RPC ist fehlgeschlagen
tr_tr: RPC bağlantısı başarısız oldu

source: Payment transaction not found. Please try again.
de_de: Zahlungsvorgang nicht gefunden. Bitte versuchen Sie es erneut.
tr_tr: Ödeme işlemi bulunamadı. Lütfen tekrar deneyin.

source: Unable to confirm payment transaction details. Please try again.
de_de: Die Details der Zahlungstransaktion konnten nicht bestätigt werden. Bitte versuchen Sie es erneut.
tr_tr: Ödeme işlemi onaylanamıyor. Lütfen tekrar deneyin.

source: Payment currency not in supported Solana tokens list.
de_de: Zahlungswährung, die in der Solana-Token-Liste nicht unterstützt wird.
tr_tr: Ödeme para birimi Solana jeton (token) listesinde bulunmamaktadır.

source: Solana Pay payment completed
de_de: Solana Pay Zahlung abgeschlossen
tr_tr: Solana Pay ödemesi tamamlandı

source: Enable/Disable
de_de: Aktivieren/Deaktivieren
tr_tr: Etkinleştirme / Devre dışı

source: Enable Solana Pay
de_de: Aktivieren Solana Pay
tr_tr: Solana Pay'i etkinleştir

source: This gateway must be enabled in order to use Solana Pay.
de_de: Dieses Gateway muss aktiviert sein, um Solana Pay nutzen zu können.
tr_tr: Solana Pay'i kullanmak için bu ağ geçidi etkinleştirilmelidir.

source: Test Mode
de_de: Testmodus
tr_tr: Test Modu

source: Enable Test Mode
de_de: Aktivieren Testmodus
tr_tr: Test Modunu Etkinleştir

source: Enable Test Mode to use Solana Devnet. Uncheck to use Solana Mainnet-Beta for Production.
de_de: Aktivieren Sie den Testmodus, um Solana Devnet zu verwenden. Deaktivieren Sie das Kontrollkästchen, um Solana Mainnet-Beta für die Produktion zu verwenden.
tr_tr: Solana Devnet'i kullanmak için Test Modunu etkinleştirin. Üretim sürümü için Solana Mainnet-Beta'yı kullanmak üzere kutunun işaretini kaldırın.

source: Merchant Wallet Address
de_de: Wallet-Adresse des Händlers
tr_tr: Satıcı Cüzdan Adresi

source: Merchant Solana wallet address where all payments will be sent.
de_de: Adresse der Solana-Wallet des Händlers, an die alle Zahlungen gesendet werden.
tr_tr: Tüm ödemelerin gönderileceği satıcı Solana cüzdan adresi.

source: Mainnet-Beta RPC Endpoint
de_de: Mainnet-Beta RPC-Endpunkt
tr_tr: Mainnet-Beta RPC Uç Noktası

source: RPC endpoint for connection to the Solana Mainnet-Beta.
de_de: RPC-Endpunkt für die Verbindung mit dem Solana Mainnet-Beta.
tr_tr: Solana Mainnet-Beta'ya bağlantı için RPC uç noktası.

source: Enable cryptocurrencies you want to accept for payments.
de_de: Aktivieren Sie Kryptowährungen, die Sie für Zahlungen akzeptieren möchten.
tr_tr: Ödemeler için kabul etmek istediğiniz kripto para birimlerini etkinleştirin.

source: Optional Settings
de_de: Optionale Einstellungen
tr_tr: İsteğe Bağlı Ayarlar

source: Options below are not mandatory.
de_de: Die folgenden Optionen sind nicht obligatorisch.
tr_tr: Aşağıdaki seçenekler zorunlu değildir.

source: Devnet RPC Endpoint
de_de: Devnet RPC-Endpunkt
tr_tr: Devnet RPC Uç Noktası

source: RPC endpoint for connection to the Solana Devnet.
de_de: RPC-Endpunkt für die Verbindung mit dem Solana Devnet.
tr_tr: Solana Devnet'e bağlantı için RPC uç noktası.

source: Brand Name
de_de: Markenname
tr_tr: Marka Adı

source: Merchant name displayed in payment instructions.
de_de: In den Zahlungsanweisungen angezeigter Händlername.
tr_tr: Ödeme talimatlarında görüntülenen satıcı adı.

source: Description
de_de: Beschreibung
tr_tr: Açıklamalar

source: Complete your payment with Solana Pay.
de_de: Bezahlen Sie mit Solana Pay.
tr_tr: Ödemenizi Solana Pay ile tamamlayın.

source: Payment method description that the customer will see in the checkout.
de_de: Beschreibung der Zahlungsmethode, die der Kunde in der Kaufabwicklung sehen wird.
tr_tr: Müşterinin kasada göreceği ödeme yöntemi açıklaması.

source: Solana Pay Payment Details
de_de: Solana Pay Zahlungsinformationen
tr_tr: Solana Pay Ödeme Detayları

source: Transaction ID
de_de: Transaktions-ID
tr_tr: İşlem Kodu

source: Customer Wallet
de_de: Kundengeldbörse
tr_tr: Müşteri Cüzdanı

source: Payment Amount
de_de: Zahlungsbetrag
tr_tr: Ödeme Miktarı

source: Reference Account
de_de: Transaktionsadresse
tr_tr: İşlem Adresi

source: Enable
de_de: Ermöglichen
tr_tr: Etkinleştir

source: Coin / Token
tr_tr: Koin / Jeton

source: Label
de_de: Etikett
tr_tr: Etiket

source: Exchange Rate
de_de: Tauschrate
tr_tr: Döviz Kuru

source: % Commission
de_de: % Kommission
tr_tr: % Komisyon

source: Preview
de_de: Vorschau
tr_tr: Önizleme

source: Solana Tokens
tr_tr: Solana Jetonları

source: <b>Solana Pay for WooCommerce</b> is an extension for <b>WooCommerce</b>. Please install and activate <b>WooCommerce</b> plugin.
de_de: <b>Solana Pay for WooCommerce</b> ist eine Erweiterung für <b>WooCommerce</b>. Bitte installieren und aktivieren Sie das <b>WooCommerce</b>-Plugin.
tr_tr: <b>WooCommerce for Solana Pay</b>, <b>WooCommerce</b> için bir uzantıdır. Lütfen <b>WooCommerce</b> eklentisini (plugin) yükleyin ve etkinleştirin.

source: <b>Solana Pay for WooCommerce</b> requires <b>BC Math</b>. Please install <b>BC Math</b> extension for PHP.
de_de: <b>Solana Pay for WooCommerce</b> erfordert <b>BC Math</b>. Bitte installieren Sie die <b>BC Math</b>-Erweiterung für PHP.
tr_tr: <b>WooCommerce for Solana Pay</b>, <b>BC Math</b> gerektirir. Lütfen <b>BC Math</b> PHP uzantısını yükleyin.

source: Pay with Browser Wallet
de_de: Bezahlen Sie mit Browser Wallet
tr_tr: Tarayıcı Uzantılı Cüzdanı ile Öde

source: OR
de_de: ODER
tr_tr: VEYA

source: Scan QR Code with Mobile Wallet
de_de: Scannen Sie den QR-Code mit Mobile Wallet
tr_tr: Mobil Cüzdan ile QR Kodunu Tarayın

source: Some inputs are not valid. Please fill all required fields.
de_de: Einige Eingaben sind nicht gültig. Bitte füllen Sie alle erforderlichen Felder aus.
tr_tr: Bazı girişler geçerli değil. Lütfen tüm gerekli alanları doldurun.
